app/views/produtos/catalogo.html.erb

        <tr>
        <% produto = Produto.all %>
---
SELECT "produtos".* FROM "produtos"