app/controllers/funcionarios_controller.rb

    def create
        funcionario = params.require(:funcionario).permit(:nome, :genero, :salario, :idade)
        Funcionario.create funcionario
---
INSERT INTO "funcionarios" ("nome", "genero", "salario", "idade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Geovanna Santos"], ["genero", "Feminino"], ["salario", 4500.0], ["idade", 33], ["created_at", "2020-01-16 20:37:34.305704"], ["updated_at", "2020-01-16 20:37:34.305704"]]

    def destroy
        @funcionario = Funcionario.find(params[:id])
        if @funcionario.destroy
---
SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "funcionarios" WHERE "funcionarios"."id" = ?  [["id", 4]]