app/controllers/produtos_controller.rb

    def create
        produto =  params.require(:produto).permit(:nome, :descricao, :preco)
        Produto.create produto
---
INSERT INTO "produtos" ("nome", "preco", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Monopoly"], ["preco", 123.0], ["descricao", "Jogo divertido pra jogar com a familia"], ["created_at", "2020-01-16 19:45:25.154885"], ["updated_at", "2020-01-16 19:45:25.154885"]]

    def destroy
        @produto = Produto.find(params[:id])
        if @produto.destroy
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 2]]