app/views/funcionarios/catalogo.html.erb

        <tr>
            <% funcionario = Funcionario.order :salario %>
---
SELECT "funcionarios".* FROM "funcionarios" ORDER BY "funcionarios"."salario" ASC